app/controllers/areas_controller.rb

SELECT `areas`.* FROM `areas`
---
  def index
    @areas = Area.all

SELECT `sub_areas`.* FROM `sub_areas` WHERE `sub_areas`.`area_id` = 2
---
    def set_area
      @area = Area.find(params[:id])