app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    if @message.save
---
INSERT INTO `messages` (`chat_id`, `user_id`, `content`, `created_at`, `updated_at`) VALUES (1, 11, 'MANOOOOO DO CEEUEUUUUUUUUUUUUUUUUUUUUUUU', '2018-05-31 04:52:00', '2018-05-31 04:52:00')