app/controllers/preferences_controller.rb

SELECT `preferences`.* FROM `preferences`
---
  def index
    @preferences = Preference.all

INSERT INTO `preferences` (`sub_area_id`, `creator_id`, `content`, `created_at`, `updated_at`) VALUES (2, 12, 'Edward Munch', '2018-05-29 00:33:21', '2018-05-29 00:33:21')
---
  def create
    @preference = Preference.new(preference_params)

    if @preference.save