app/controllers/sub_areas_controller.rb

SELECT `sub_areas`.* FROM `sub_areas`
---
  def index
    @sub_areas = SubArea.all

SELECT  `sub_areas`.* FROM `sub_areas` WHERE `sub_areas`.`id` = 2 LIMIT 1
---
    def set_sub_area
      @sub_area = SubArea.find(params[:id])