app/controllers/users_controller.rb

  def choose_preference
    current_user.preferences << @preference if !(current_user.preferences.include?(@preference))
---
INSERT INTO `user_preferences` (`user_id`, `preference_id`, `created_at`, `updated_at`) VALUES (14, 1, '2018-05-31 00:26:27', '2018-05-31 00:26:27')
SELECT  1 AS one FROM `preferences` INNER JOIN `user_preferences` ON `preferences`.`id` = `user_preferences`.`preference_id` WHERE `user_preferences`.`user_id` = 51 AND `preferences`.`id` = 1 LIMIT 1
SELECT `preferences`.* FROM `preferences` INNER JOIN `user_preferences` ON `preferences`.`id` = `user_preferences`.`preference_id` WHERE `user_preferences`.`user_id` = 14

  def set_preference
    @preference = Preference.find(params[:id])
---
SELECT  `preferences`.* FROM `preferences` WHERE `preferences`.`id` = 1 LIMIT 1

  def set_user
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`uid` = 'bennett@kubgusikowski.org' LIMIT 1

  def set_chat
    if !(Match.where(id: params[:match_id]).blank?)
      @chat = Match.where(id: params[:match_id]).first.chat
---
SELECT  `matches`.* FROM `matches` WHERE `matches`.`id` = 2 ORDER BY `matches`.`id` ASC LIMIT 1
SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1